// *++
//
// Copyright 2005, Intel Corporation                                                         
// All rights reserved. This program and the accompanying materials                          
// are licensed and made available under the terms and conditions of the BSD License         
// which accompanies this distribution. The full text of the license may be found at         
// http://opensource.org/licenses/bsd-license.php                                            
//                                                                                           
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,                     
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.             
// 
// Module Name:
//
//   clsstrings.uni
//  
// Abstract:
// 
//   String definitions for the Shell cls command
// 
// Revision History:
// 
// --*/

/=#

#langdef   eng "English"
#langdef   fra "Français"

#string STR_CLS_TOO_MANY_ARGS                #language eng  "%hs: Too many arguments\n"

#string STR_CLS_INVALID_ARG                  #language eng  "%hs: Invalid argument - '%hs'\n"

#string STR_CLS_LINE_HELP              #language eng  "Clears the standard output with an optional background color"

#string STR_CLS_VERBOSE_HELP           #language eng  "Clears the standard output with an optional background color.\n"  
                                                      "\n"
                                                      "CLS [color]\n"
                                                      "\n"
                                                      "    color     - New background color\n"
                                                      "                0   - Black\n"
                                                      "                1   - Blue\n"
                                                      "                2   - Green\n"
                                                      "                3   - Cyan\n"
                                                      "                4   - Red\n"
                                                      "                5   - Magenta\n"
                                                      "                6   - Yellow\n"
                                                      "                7   - Light gray\n"
                                                      "\n"
                                                      "Note:\n"
                                                      "    1. If no parameters are specified, this command clears the standard output device.The\n"
                                                      "       background color is not changed.\n"
                                                      "\n"
                                                      "Examples:\n"
                                                      "  * To clear the output but not change the background color:\n"
                                                      "    fs0:\\> cls\n"
                                                      "\n"
                                                      "  * To clear the output and change the background color to Cyan:\n"
                                                      "    fs0:\\> cls 3\n"
                                                      "\n"
                                                      "  * To clear the output and change the background with default color (black):\n"
                                                      "    fs0:\\> cls 0\n"                                                       
